Repository: tatankat/thebuggenie
Catalog: modules/auth_ldap/i18n/*/strings.xlf
Languages: de_de

source: Import failed
de_de: Import fehlgeschlagen

source: Import successful! Imported %imported users and updated %updated users out of total %total valid users found in LDAP
de_de: Import erfolgreich abgeschlossen. %imported Benutzer importiert und %updated von insgesamt %total in LDAP gefundenen gültigen Benutzern aktualisiert

source: Pruning failed
de_de: Benutzer aufräumen fehlgeschlagen

source: Pruning successful! %deleted users deleted
de_de: Erfolgreich aufgeräumt! %deleted Benutzer gelöscht

source: Use this page to set up the connection details for your LDAP or Active Directory server. It is highly recommended that you read the online help before use, as misconfiguration may prevent you from accessing configuration pages to rectify issues.
de_de: Verwenden Sie diese Seite, um die Verbindungsdetails für Ihre LDAP- oder Active Directory-Server einzurichten. Es wird dringend empfohlen, dass Sie die Online-Hilfe vor dem Gebrauch lesen. Eine Fehlkonfiguration kann möglicherweise den Aufruf von Konfigurationsseiten zur Korrektur von Problemen verhindern.

source: View the online documentation
de_de: Onlinedokumentation ansehen

source: LDAP support is not installed
de_de: LDAP-Support ist nicht installiert

source: The PHP LDAP extension is required to use this functionality. As this module is not installed, all functionality on this page has been disabled.
de_de: Die PHP-LDAP-Erweiterung wird für diese Funktion benötigt. Solange das Modul nicht installiert ist, sind alle Funktionen auf dieser Seite deaktiviert.

source: Important information
de_de: Wichtige Information

source: When you enable LDAP as your authentication backend in Authentication configuration, you will lose access to all accounts which do not also exist in the LDAP database. This may mean you lose administrative access.
de_de: Beim Aktivieren von LDAP als Ihr Authentifizierungs-Backend in der Authentifizierungskonfiguration verlieren Sie den Zugriff auf alle Konten, die nicht auch in der LDAP-Datenbank existieren. Dies kann bedeuten, dass Sie den Administratorzugriff verlieren.

source: To resolve this issue, either import all users using the tool on this page and make one an administrator using Users configuration, or create a user with the same username as one in LDAP and make that one an administrator.
de_de: Um diesen Fall zu beheben, importieren Sie alle Benutzer, welche das Werkzeug auf dieser Seite benutzen und setzen Sie einen Benutzer in der Benutzerkonfiguration als Administrator ein, oder erstellen Sie einen Benutzer mit demselben Benutzernamen wie in LDAP und ernennen Sie ihn zum Administrator.

source: Connection details
de_de: Verbindungsdetails

source: LDAP connection URI
de_de: LDAP Verbindungs-URI

source: URI used for connecting to the LDAP server. Format is <schema://[name[:port]]/>, where schema is one of: ldap (plain-text), ldaps (TLS connection), or ldapi (UNIX domain socket). For example: ldap://hostname/, ldap://hostname:1389/, ldaps://hostname:636/, ldaps://hostname:1636/, ldapi:///.
de_de: Für die Verbindung eingesetzte URI zum LDAP Server. Das Format ist <schema://[name[:port]]/>, bei dem das Schema einem der folgenden entsprechen muss: ldap (plain-text), ldaps (TLS connection), or ldapi (UNIX domain socket). Zum Beispiel: ldap://hostname/, ldap://hostname:1389/, ldaps://hostname:636/, ldaps://hostname:1636/, ldapi:///.

source: Base DN
de_de: Basis DN

source: Base DN under which all user and group entires can be found. For example: dc=ldap,c=example,dc=com.
de_de: Basis-DN, unter welchem alle Benutzer und Gruppeneinträge gefunden werden können. Zum Beispiel dc=ldap,c=example,dc=com.

source: Control user DN
de_de: Benutzer DN kontrollieren

source: LDAP distinguished name (DN) for control user. Control user needs to be able to access all relevant user and allowed group entries in the LDAP directory. Read-only access is sufficient. The user does not need to be able to read any credentials (passwords). To use anonymous bind for control user, leave the setting blank. For example: cn=tbg,ou=services,c=example,dc=com.
de_de: LDAP distinguished name (DN) für den Kontrollbenutzer. Der Kontrollbenutzer muss Zugriff auf alle relevanten Benutzer und erlaubten Gruppeneinträge im LDAP Verzeichnis haben. Leserechte sind ausreichend. Der Benutzer muss nicht in der Lage sein, Anmeldedaten (Passwörter) zu lesen. Um anonyme Verbindungen für den Kontrollbenutzer zu verwenden, lassen Sie die Einstelluung frei. Zum Beispiel: cn=tbg,ou=services,c=example,dc=com.

source: Control user password
de_de: Benutzerpasswort kontrollieren

source: Password for logging in into LDAP directory using the control user DN. To use anonymous bind for control user, leave the setting blank.
de_de: Passwort, um mit dem Kontrollbenutzer ins LDAP Verzeichnis einzuloggen. Um eine anonyme Verbindung für den Kontrollbenutzer zu verwenden, lassen Sie die Einstellungen leer.

source: Use HTTP Integrated Authentication
de_de: Benütze HTTP integrierte Authentifizierung

source: Enable automated login by using username passed-in into application via HTTP header. This requires that the web server performs authentication on behalf of The Bug Genie (e.g. HTTP Basic Authentication, Kerberos etc).
de_de: Automatisches einloggen in die Applikation per Verwendung des Benutzernamens im HTTP Header aktivieren. Das setzt voraus, dass der Webserver eine von The Bug Genie unterstützte Authentifizierung erlaubt (z. B. HTTP Basic Authentifizierung, Kerberos usw.).

source: HTTP header field
de_de: HTTP Header Feld

source: HTTP header field containing the username if HTTP Integrated Authentication is enabled. For example: REMOTE_USER.
de_de: HTTP Headerfeld, das den Benutzernamen enthält, wenn die HTTP integrierte Authentifizierung aktiviert ist. Zum Beispiel: REMOTE_USER.

source: Object DN attribute
de_de: Eigenschaft Objekt DN

source: LDAP attribute that contains the distinguished name of an object. On most LDAP servers this shouild be set to entrydn. If using Active Directory, set the value to distinguishedName.
de_de: LDAP Attribut, welches den distinguished name des Objekts enthält. Bei den meisten LDAP Servern sollte dies der entrydn sein. Setzen Sie den Wert auf distinguishedName bei der Verwendung von Active Directory.

source: User object class
de_de: Benutzerobjektklasse

source: Object class used for locating valid user entries. For example: person, inetOrgPerson.
de_de: Objektklasse, die für die Evaluation von gültigen Benutzereinträgen benützt wird. Zum Beispiel: person, inetOrgPerson.

source: User username attribute
de_de: Eigenschaft Benutzername

source: LDAP attribute where the username is stored. For example: uid.
de_de: LDAP Attribut, in dem der Benutzername gespeichert ist. Zum Beispiel: uid.

source: User full name attribute
de_de: Eigenschaft vollständiger Benutzername

source: LDAP attribute where the full name of the user is stored. If not specified, cn will be used if available. For example: displayName.
de_de: LDAP Attribut, in den der vollständige Name des Benutzers gespeichert ist. Wenn nicht angegeben, wird cn falls vorhanden berücksichtigt. Zum Beispiel: displayName.

source: User buddy name attribute
de_de: Attribut Spitzname

source: LDAP attribute where the buddy name is stored. For example: gn.
de_de: LDAP Attribut, in dem der Spitzname gespeichert ist. Zum Beispiel: gn.

source: User e-mail address attribute
de_de: Eigenschaft Benutzer E-Mail Adresse

source: LDAP attribute where the e-mail is stored. For example: mail.
de_de: LDAP Attribut, in dem die E-Mail Adresse gespeichert ist. Zum Beispiel: mail.

source: Allowed groups
de_de: Erlaubte Gruppen

source: Comma-separated list of allowed groups. Each group should be specified by its common name (cn) attribute. If specified, only users that are members of these groups will be able to access The Bug Genie. Leave this option blank to disable group membership checks and allow any valid LDAP user to access The Bug Genie. For example: tbg,mygroup1,mygroup2.
de_de: Kommagetrennte Liste der erlaubten Gruppen. Jede Gruppe sollte durch den common name (cn) definiert werden. Wenn angegeben, werden nur Benutzer dieser Gruppen Zugriff auf The Bug Genie haben. Lassen Sie diese Option leer um Gruppenzugehörigkeitenprüfungen zu deaktivieren und jegliche gültigen LDAP Benutzer für The Bug Genie zuzulassen. Zum Beispiel: tbg,mygroup1,mygroup2.

source: Group object class
de_de: Gruppenobjektklasse

source: Object class used for locating valid allowed group entries. For example: groupOfNames, groupOfUniqueNames.
de_de: Objektklasse, die für die Evaluation von gültigen Gruppeneinträgen benützt wird. Zum Beispiel: groupOfNames, groupOfUniqueNames.

source: Group member attribute
de_de: Eigenschaft Gruppenmitglied

source: LDAP attribute in allowed group entries where member users are stored. For example: member, uniqueMember.
de_de: LDAP Attribut in erlaubten Gruppeneinträgen, in welchem Mitgliederbenutzer gespeichert sind. Zum Beispiel: member, uniqueMember.

source: Click "%save" to save the settings
de_de: Klicken Sie "%save" um Ihre Einstellungen zu speichern

source: Save
de_de: Speichern

source: Test connection
de_de: Verbindung testen

source: After configuring and saving your connection settings, you should test your connection to the LDAP server. This test does not check whether the DN and attributes can allow The Bug Genie to correctly find users, but it will give an indication if The Bug Genie can talk to your LDAP server, and if any groups you specify exist. If HTTP integrated authentication is enabled, this will also test that your web server is providing the configured header.
de_de: Nachdem Sie die Verbindungseinstellungen gesetzt und gespeichert haben, sollten Sie Ihre Verbindung zum LDAP Server prüfen. Dieser Test prüft nicht, ob der DN und die Attribute es The Bug Genie erlauben, die korrrekten Benutzer zu finden, aber es gibt einen Hinweis darauf, ob The Bug Genie mit dem LDAP Server kommunizieren kann, und ob die definierten Gruppen existieren. Wenn die HTTP integrierte Authentifizierung aktiviert ist, wird dies auch testen, ob der Web Server den konfigurierten Header unterstützt.

source: Import all users
de_de: Alle Benutzer importieren

source: You can import all users who can log in from LDAP into The Bug Genie with this tool. This will not let them log in without switching to LDAP Authentication. We recomemnd you do this before switching over, and make at least one of the new users an administrator. Already existing users with the same username will be updated.
de_de: Sie können alle Benutzer importieren, welche sich von LDAP in The Bug Genie mit diesem Werkzeug einloggen können. Dies wird nicht dazu führen, dass sich die Benutzer ohne LDAP Authentifizierung einloggen können. Wir empfehlen Ihnen, vor dem umstellen zu importieren und mindestens einem neuen Benutzer Administratorenrechte zu vergeben. Bereits existierende Benutzer mit demselben Benutzernamen werden aktualisiert.

source: Import users
de_de: Importiere Benutzer

source: Prune users
de_de: Benutzer aufräumen

source: To remove the data from The Bug Genie of users who can no longer log in via LDAP, run this tool. These users would not be able to log in anyway, but it will keep your user list clean. The guest user is not affected, but it may affect your current user - if this is deleted you will be logged out.
de_de: Benützen Sie dieses Werkzeug, um die Daten von Benutzern von The Bug Genie zu entfernen, die sich nicht mehr via LDAP anmelden können. Diese Benutzer werden sowieso nicht mehr in der Lage sein, sich einzuloggen, aber es wird Ihre Benutzerliste sauber halten. Der Gast Benutzer ist nicht betroffen, aber es kann Ihren aktuellen Benutzer betreffen - wenn er gelöscht wird werden Sie ausgeloggt.

source: LDAP connection URI must be specified.
de_de: LDAP Verbindungs-URI muss definiert werden.

source: Base DN must be specified.
de_de: Basis-DN muss angegeben werden.

source: Object DN attribute must be specified.
de_de: Objekt-DN muss angegeben werden.

source: User object class must be specified.
de_de: Benutzerobjektklasse muss angegeben werden.

source: User username attribute must be specified.
de_de: Attribut Benutzername muss angegeben werden.

source: Both group object class and group member attribute must be specified if allowed groups are provided.
de_de: Sowohl das Attribut Objektgruppenklasse als auch das Attribut Gruppenmitglied muss definiert sein wenn Gruppen unterstützt werden sollen.

source: HTTP header field must be specified if HTTP Integrated Authentication is enabled.
de_de: HTTP Headerfeld muss definiert werden wenn die HTTP integrierte Authentifizierung aktiviert ist.

source: LDAP connection URL has invalid syntax.
de_de: LDAP Verbindungs-URL hat eine ungültige Syntax.

source: Failed to bind as control user. Error was: %error
de_de: Verbindung als Kontrollbenutzer fehlgeschlagen. Gemeldeter Fehler: %error

source: LDAP search failed. Filter: %filter; Error: %error
de_de: LDAP Suche fehlgeschlagen. %filter; Fehler: %error

source: Failed to validate groups (groups do not exist or multiple entries were found): %groups
de_de: Gruppenvalidierung fehlgeschlagen (Gruppen existieren nicht oder mehrere Einträge gefunden): %groups

source: Failed to locate any valid users in LDAP directory.
de_de: Suche nach gültigen Benutzern im LDAP Verzeichnis fehlgeschlagen.

source: HTTP integrated authentication is enabled but the %headerfield header is not being provided to The Bug Genie. Please check your web server configuration.
de_de: HTTP integrierte Authentifizierung ist aktiviert aber der HTTP Header %headerfield wird von The Bug Genie nicht unterstützt. bitte prüfen Sie Ihre Webserverkonfiguration.

source: Failed to locate current user (%username) in LDAP directory. If you enable LDAP authentication, you may find yourself locked-out of the settings. All other checks have passed.
de_de: Feststellen des aktiven Benutzers (%username) im LDAP Verzeichnis fehlgeschlagen. Wenn Sie die LDAP Authentifizierung aktiviert haben, sind Sie durch die Einstellungen ausgesperrt. Alle anderen Prüfungen wurden erfolgreich abgeschlossen.

source: LDAP connection test failed
de_de: LDAP Verbindungstest fehlgeschlagen

source: Connection test successful
de_de: Verbindungstest erfolgreich

source: All LDAP connection tests have passed.
de_de: Alle LDAP Verbindungstests erfolgreich abgeschlossen.

source: LDAP module has not been configured correctly. Please check your settings and test connection.
de_de: Das LDAP Modul wurde nicht korrekt konfiguriert. Bitte die Einstellungen prüfen und die Verbindung testen.

source: HTTP integrated authentication is enabled but the HTTP header has not been provided by the web server.
de_de: HTTP integrierte Authentifizierung ist aktiviert aber der HTTP Header wird vom Webserver nicht unterstützt.

source: This user was found multiple times in the directory, please contact your administrator
de_de: Dieser Benutzer wurde mehrmals im Verzeichnis gefunden, bitte kontaktieren Sie Ihren Admimistrator

source: HTTP authentication internal error.
de_de: Interner Fehler bei HTTP Authentifizierung.
